exampleCases/example.propALMAdvanced/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       pimpleALMFoam;

  libs              ();

  startFrom         latestTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           5.0;

  deltaT            1e-4;

  writeControl      adjustableRunTime;

  writeInterval     0.001; 

  purgeWrite        100;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  uncompressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         2.5e-2;

// ************************************************************************* //

