exampleCases/example.propALMAdvanced/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.0  0.0   0.0)
    ( 3.0  0.0   0.0)
    ( 3.0  0.5   0.0)
    ( 0.0  0.5   0.0)
    ( 0.0  0.0   0.5)
    ( 3.0  0.0   0.5)
    ( 3.0  0.5   0.5)
    ( 0.0  0.5   0.5)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    OUTLET
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    WALLS
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
	    (0 3 2 1)
	    (4 5 6 7)
        );
    }
    INLET
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
