exampleCases/example.propALMAdvanced/constant/airfoilProperties/CLARKY500k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
Name = clarky
Mach = 0; Re = 500000; T.U. = 1.0; T.L. = 1.0

Alpha	Cl		Cd	
[°]	   [-]		[-]
*/
airfoilData
(
(-180 -3.1023e-01 2.0319e-02)
(-120 3.4100e-01 1.0395e+00)
(-90  -1.7424e-01 1.5621e+00)
(-80  -3.8826e-01 1.8038e+00)
(-70  -6.5750e-01 1.5602e+00)
(-60  -8.1014e-01 1.3107e+00)
(-50  -8.7955e-01 1.0498e+00)
(-40  -8.6800e-01 7.9776e-01)
(-30  -6.4612e-01 4.7365e-01)
(-20  -4.1964e-01 2.5460e-01)
(-15  -3.0611e-01  1.7695e-01)
(-10  -1.6048e-01  1.0617e-01)
(-5   5.0106e-02  4.0789e-02)
(0	4.1628e-01  2.1358e-02)
(5  8.7825e-01	2.4972e-02)
(10	1.1543e+00	5.3307e-02)
(15 1.0517e+00	1.2779e-01)
(20	9.4561e-01	2.5433e-01)
(30 9.9249e-01  5.3351e-01)
(40 1.1151e+00  8.8146e-01)
(50 1.0931e+00  1.1829e+00)
(60 8.4690e-01  1.3276e+00)
(70 6.8765e-01  1.6342e+00)
(80 4.3456e-01  1.5544e+00)
(90 0.10		1.50)
(120 -0.65		1.25)
(180 -3.1266e-01 2.0415e-02)

);
