exampleCases/example.propALMAdvanced/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1e-5;

boundaryField
{

    INLET
    {
        type            fixedValue;
        value           $internalField;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    
    WALLS
    {
	type		zeroGradient;
    }

    "proc.*"
    {
    	type            processor;
    }
}


// ************************************************************************* //
