exampleCases/example.propALMAdvanced/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{

    INLET
    {
        type            fixedValue;
        value		$internalField;
    }

    OUTLET
    {
        type            zeroGradient;
    }
    
    WALLS
    {
	type		zeroGradient;
    }

    "proc.*"
    {
    	type            processor;
    }
}


// ************************************************************************* //
