exampleCases/example.propALMAdvanced/system/sampling/cloud_1D
    cloudData1D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       50;
      setFormat            raw;
      fields
      (
         U
         omega
         Q
      );

      sets
      (
         sampleplane1D
         {
            type         cloud;
            axis         xyz;
            points       (

            (726.400 1310.400 0.001)
            (726.400 1315.400 0.001)
            (726.400 1320.400 0.001)
            (726.400 1325.400 0.001)
            (726.400 1330.400 0.001)
            (726.400 1335.400 0.001)
            (726.400 1340.400 0.001)
            (726.400 1345.400 0.001)
            (726.400 1350.400 0.001)
            (726.400 1355.400 0.001)
            (726.400 1360.400 0.001)
            (726.400 1365.400 0.001)
            (726.400 1370.400 0.001)
            (726.400 1375.400 0.001)
            (726.400 1380.400 0.001)
            (726.400 1385.400 0.001)
            (726.400 1390.400 0.001)
            (726.400 1395.400 0.001)
            (726.400 1400.400 0.001)
            (726.400 1405.400 0.001)
            (726.400 1410.400 0.001)
            (726.400 1415.400 0.001)
            (726.400 1420.400 0.001)
            (726.400 1425.400 0.001)
            (726.400 1430.400 0.001)
            (726.400 1435.400 0.001)
            (726.400 1440.400 0.001)
            (726.400 1445.400 0.001)
            (726.400 1450.400 0.001)
            (726.400 1455.400 0.001)
            (726.400 1460.400 0.001)
            (726.400 1465.400 0.001)
            (726.400 1470.400 0.001)
            (726.400 1475.400 0.001)
            (726.400 1480.400 0.001)
            (726.400 1485.400 0.001)
            (726.400 1490.400 0.001)
            (726.400 1495.400 0.001)
            (726.400 1500.400 0.001)
            (726.400 1505.400 0.001)
            (726.400 1510.400 0.001)
            (726.400 1515.400 0.001)
            (726.400 1520.400 0.001)
            (726.400 1525.400 0.001)
            (726.400 1530.400 0.001)
            (726.400 1535.400 0.001)
            (726.400 1540.400 0.001)
            (726.400 1545.400 0.001)
            (726.400 1550.400 0.001)
            (726.400 1555.400 0.001)
            (726.400 1560.400 0.001)
            (726.400 1565.400 0.001)
            (726.400 1570.400 0.001)
            (726.400 1575.400 0.001)
            (726.400 1580.400 0.001)
            (726.400 1585.400 0.001)
            (726.400 1590.400 0.001)
            (726.400 1595.400 0.001)
            (726.400 1600.400 0.001)
            (726.400 1605.400 0.001)
            (726.400 1610.400 0.001)
            (726.400 1615.400 0.001)
            (726.400 1620.400 0.001)
            (726.400 1625.400 0.001)
            (726.400 1630.400 0.001)
            (726.400 1635.400 0.001)
            (726.400 1640.400 0.001)
            (726.400 1645.400 0.001)
            (726.400 1650.400 0.001)
            (726.400 1655.400 0.001)
            (726.400 1660.400 0.001)
            (726.400 1665.400 0.001)
            (726.400 1670.400 0.001)
            (726.400 1675.400 0.001)
            (726.400 1680.400 0.001)
            (726.400 1685.400 0.001)
            (726.400 1310.400 5.001)
            (726.400 1315.400 5.001)
            (726.400 1320.400 5.001)
            (726.400 1325.400 5.001)
            (726.400 1330.400 5.001)
            (726.400 1335.400 5.001)
            (726.400 1340.400 5.001)
            (726.400 1345.400 5.001)
            (726.400 1350.400 5.001)
            (726.400 1355.400 5.001)
            (726.400 1360.400 5.001)
            (726.400 1365.400 5.001)
            (726.400 1370.400 5.001)
            (726.400 1375.400 5.001)
            (726.400 1380.400 5.001)
            (726.400 1385.400 5.001)
            (726.400 1390.400 5.001)
            (726.400 1395.400 5.001)
            (726.400 1400.400 5.001)
            (726.400 1405.400 5.001)
            (726.400 1410.400 5.001)
            (726.400 1415.400 5.001)
            (726.400 1420.400 5.001)
            (726.400 1425.400 5.001)
...
            (726.400 1685.400 215.001)

                          );
         }
      );
    }
