exampleCases/example.propALMAdvanced/system/sampling/cloud_5D
    cloudData5D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       50;
      setFormat            raw;
      fields
      (
         U
         omega
         Q
      );

      sets
      (
         sampleplane5D
         {
            type         cloud;
            axis         xyz;
            points       (

            (1232.000 1310.400 0.001)
            (1232.000 1315.400 0.001)
            (1232.000 1320.400 0.001)
            (1232.000 1325.400 0.001)
            (1232.000 1330.400 0.001)
            (1232.000 1335.400 0.001)
            (1232.000 1340.400 0.001)
            (1232.000 1345.400 0.001)
            (1232.000 1350.400 0.001)
            (1232.000 1355.400 0.001)
            (1232.000 1360.400 0.001)
            (1232.000 1365.400 0.001)
            (1232.000 1370.400 0.001)
            (1232.000 1375.400 0.001)
            (1232.000 1380.400 0.001)
            (1232.000 1385.400 0.001)
            (1232.000 1390.400 0.001)
            (1232.000 1395.400 0.001)
            (1232.000 1400.400 0.001)
            (1232.000 1405.400 0.001)
            (1232.000 1410.400 0.001)
            (1232.000 1415.400 0.001)
            (1232.000 1420.400 0.001)
            (1232.000 1425.400 0.001)
            (1232.000 1430.400 0.001)
            (1232.000 1435.400 0.001)
            (1232.000 1440.400 0.001)
            (1232.000 1445.400 0.001)
            (1232.000 1450.400 0.001)
            (1232.000 1455.400 0.001)
            (1232.000 1460.400 0.001)
            (1232.000 1465.400 0.001)
            (1232.000 1470.400 0.001)
            (1232.000 1475.400 0.001)
            (1232.000 1480.400 0.001)
            (1232.000 1485.400 0.001)
            (1232.000 1490.400 0.001)
            (1232.000 1495.400 0.001)
            (1232.000 1500.400 0.001)
            (1232.000 1505.400 0.001)
            (1232.000 1510.400 0.001)
            (1232.000 1515.400 0.001)
            (1232.000 1520.400 0.001)
            (1232.000 1525.400 0.001)
            (1232.000 1530.400 0.001)
            (1232.000 1535.400 0.001)
            (1232.000 1540.400 0.001)
            (1232.000 1545.400 0.001)
            (1232.000 1550.400 0.001)
            (1232.000 1555.400 0.001)
            (1232.000 1560.400 0.001)
            (1232.000 1565.400 0.001)
            (1232.000 1570.400 0.001)
            (1232.000 1575.400 0.001)
            (1232.000 1580.400 0.001)
            (1232.000 1585.400 0.001)
            (1232.000 1590.400 0.001)
            (1232.000 1595.400 0.001)
            (1232.000 1600.400 0.001)
            (1232.000 1605.400 0.001)
            (1232.000 1610.400 0.001)
            (1232.000 1615.400 0.001)
            (1232.000 1620.400 0.001)
            (1232.000 1625.400 0.001)
            (1232.000 1630.400 0.001)
            (1232.000 1635.400 0.001)
            (1232.000 1640.400 0.001)
            (1232.000 1645.400 0.001)
            (1232.000 1650.400 0.001)
            (1232.000 1655.400 0.001)
            (1232.000 1660.400 0.001)
            (1232.000 1665.400 0.001)
            (1232.000 1670.400 0.001)
            (1232.000 1675.400 0.001)
            (1232.000 1680.400 0.001)
            (1232.000 1685.400 0.001)
            (1232.000 1310.400 5.001)
            (1232.000 1315.400 5.001)
            (1232.000 1320.400 5.001)
            (1232.000 1325.400 5.001)
            (1232.000 1330.400 5.001)
            (1232.000 1335.400 5.001)
            (1232.000 1340.400 5.001)
            (1232.000 1345.400 5.001)
            (1232.000 1350.400 5.001)
            (1232.000 1355.400 5.001)
            (1232.000 1360.400 5.001)
            (1232.000 1365.400 5.001)
            (1232.000 1370.400 5.001)
            (1232.000 1375.400 5.001)
            (1232.000 1380.400 5.001)
            (1232.000 1385.400 5.001)
            (1232.000 1390.400 5.001)
            (1232.000 1395.400 5.001)
            (1232.000 1400.400 5.001)
            (1232.000 1405.400 5.001)
            (1232.000 1410.400 5.001)
            (1232.000 1415.400 5.001)
            (1232.000 1420.400 5.001)
            (1232.000 1425.400 5.001)
...
            (1232.000 1685.400 215.001)

                          );
         }
      );
    }
