exampleCases/example.propALMAdvanced/system/sampling/cloud_7D
    cloudData7D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       50;
      setFormat            raw;
      fields
      (
         U
         omega
         Q
      );

      sets
      (
         sampleplane7D
         {
            type         cloud;
            axis         xyz;
            points       (

            (1484.800 1310.400 0.001)
            (1484.800 1315.400 0.001)
            (1484.800 1320.400 0.001)
            (1484.800 1325.400 0.001)
            (1484.800 1330.400 0.001)
            (1484.800 1335.400 0.001)
            (1484.800 1340.400 0.001)
            (1484.800 1345.400 0.001)
            (1484.800 1350.400 0.001)
            (1484.800 1355.400 0.001)
            (1484.800 1360.400 0.001)
            (1484.800 1365.400 0.001)
            (1484.800 1370.400 0.001)
            (1484.800 1375.400 0.001)
            (1484.800 1380.400 0.001)
            (1484.800 1385.400 0.001)
            (1484.800 1390.400 0.001)
            (1484.800 1395.400 0.001)
            (1484.800 1400.400 0.001)
            (1484.800 1405.400 0.001)
            (1484.800 1410.400 0.001)
            (1484.800 1415.400 0.001)
            (1484.800 1420.400 0.001)
            (1484.800 1425.400 0.001)
            (1484.800 1430.400 0.001)
            (1484.800 1435.400 0.001)
            (1484.800 1440.400 0.001)
            (1484.800 1445.400 0.001)
            (1484.800 1450.400 0.001)
            (1484.800 1455.400 0.001)
            (1484.800 1460.400 0.001)
            (1484.800 1465.400 0.001)
            (1484.800 1470.400 0.001)
            (1484.800 1475.400 0.001)
            (1484.800 1480.400 0.001)
            (1484.800 1485.400 0.001)
            (1484.800 1490.400 0.001)
            (1484.800 1495.400 0.001)
            (1484.800 1500.400 0.001)
            (1484.800 1505.400 0.001)
            (1484.800 1510.400 0.001)
            (1484.800 1515.400 0.001)
            (1484.800 1520.400 0.001)
            (1484.800 1525.400 0.001)
            (1484.800 1530.400 0.001)
            (1484.800 1535.400 0.001)
            (1484.800 1540.400 0.001)
            (1484.800 1545.400 0.001)
            (1484.800 1550.400 0.001)
            (1484.800 1555.400 0.001)
            (1484.800 1560.400 0.001)
            (1484.800 1565.400 0.001)
            (1484.800 1570.400 0.001)
            (1484.800 1575.400 0.001)
            (1484.800 1580.400 0.001)
            (1484.800 1585.400 0.001)
            (1484.800 1590.400 0.001)
            (1484.800 1595.400 0.001)
            (1484.800 1600.400 0.001)
            (1484.800 1605.400 0.001)
            (1484.800 1610.400 0.001)
            (1484.800 1615.400 0.001)
            (1484.800 1620.400 0.001)
            (1484.800 1625.400 0.001)
            (1484.800 1630.400 0.001)
            (1484.800 1635.400 0.001)
            (1484.800 1640.400 0.001)
            (1484.800 1645.400 0.001)
            (1484.800 1650.400 0.001)
            (1484.800 1655.400 0.001)
            (1484.800 1660.400 0.001)
            (1484.800 1665.400 0.001)
            (1484.800 1670.400 0.001)
            (1484.800 1675.400 0.001)
            (1484.800 1680.400 0.001)
            (1484.800 1685.400 0.001)
            (1484.800 1310.400 5.001)
            (1484.800 1315.400 5.001)
            (1484.800 1320.400 5.001)
            (1484.800 1325.400 5.001)
            (1484.800 1330.400 5.001)
            (1484.800 1335.400 5.001)
            (1484.800 1340.400 5.001)
            (1484.800 1345.400 5.001)
            (1484.800 1350.400 5.001)
            (1484.800 1355.400 5.001)
            (1484.800 1360.400 5.001)
            (1484.800 1365.400 5.001)
            (1484.800 1370.400 5.001)
            (1484.800 1375.400 5.001)
            (1484.800 1380.400 5.001)
            (1484.800 1385.400 5.001)
            (1484.800 1390.400 5.001)
            (1484.800 1395.400 5.001)
            (1484.800 1400.400 5.001)
            (1484.800 1405.400 5.001)
            (1484.800 1410.400 5.001)
            (1484.800 1415.400 5.001)
            (1484.800 1420.400 5.001)
            (1484.800 1425.400 5.001)
...
            (1484.800 1685.400 215.001)

                          );
         }
      );
    }
