exampleCases/example.propALMAdvanced/system/sampling/cloud_8D
    cloudData8D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       50;
      setFormat            raw;
      fields
      (
         U
         omega
         Q
      );

      sets
      (
         sampleplane8D
         {
            type         cloud;
            axis         xyz;
            points       (

            (1611.200 1310.400 0.001)
            (1611.200 1315.400 0.001)
            (1611.200 1320.400 0.001)
            (1611.200 1325.400 0.001)
            (1611.200 1330.400 0.001)
            (1611.200 1335.400 0.001)
            (1611.200 1340.400 0.001)
            (1611.200 1345.400 0.001)
            (1611.200 1350.400 0.001)
            (1611.200 1355.400 0.001)
            (1611.200 1360.400 0.001)
            (1611.200 1365.400 0.001)
            (1611.200 1370.400 0.001)
            (1611.200 1375.400 0.001)
            (1611.200 1380.400 0.001)
            (1611.200 1385.400 0.001)
            (1611.200 1390.400 0.001)
            (1611.200 1395.400 0.001)
            (1611.200 1400.400 0.001)
            (1611.200 1405.400 0.001)
            (1611.200 1410.400 0.001)
            (1611.200 1415.400 0.001)
            (1611.200 1420.400 0.001)
            (1611.200 1425.400 0.001)
            (1611.200 1430.400 0.001)
            (1611.200 1435.400 0.001)
            (1611.200 1440.400 0.001)
            (1611.200 1445.400 0.001)
            (1611.200 1450.400 0.001)
            (1611.200 1455.400 0.001)
            (1611.200 1460.400 0.001)
            (1611.200 1465.400 0.001)
            (1611.200 1470.400 0.001)
            (1611.200 1475.400 0.001)
            (1611.200 1480.400 0.001)
            (1611.200 1485.400 0.001)
            (1611.200 1490.400 0.001)
            (1611.200 1495.400 0.001)
            (1611.200 1500.400 0.001)
            (1611.200 1505.400 0.001)
            (1611.200 1510.400 0.001)
            (1611.200 1515.400 0.001)
            (1611.200 1520.400 0.001)
            (1611.200 1525.400 0.001)
            (1611.200 1530.400 0.001)
            (1611.200 1535.400 0.001)
            (1611.200 1540.400 0.001)
            (1611.200 1545.400 0.001)
            (1611.200 1550.400 0.001)
            (1611.200 1555.400 0.001)
            (1611.200 1560.400 0.001)
            (1611.200 1565.400 0.001)
            (1611.200 1570.400 0.001)
            (1611.200 1575.400 0.001)
            (1611.200 1580.400 0.001)
            (1611.200 1585.400 0.001)
            (1611.200 1590.400 0.001)
            (1611.200 1595.400 0.001)
            (1611.200 1600.400 0.001)
            (1611.200 1605.400 0.001)
            (1611.200 1610.400 0.001)
            (1611.200 1615.400 0.001)
            (1611.200 1620.400 0.001)
            (1611.200 1625.400 0.001)
            (1611.200 1630.400 0.001)
            (1611.200 1635.400 0.001)
            (1611.200 1640.400 0.001)
            (1611.200 1645.400 0.001)
            (1611.200 1650.400 0.001)
            (1611.200 1655.400 0.001)
            (1611.200 1660.400 0.001)
            (1611.200 1665.400 0.001)
            (1611.200 1670.400 0.001)
            (1611.200 1675.400 0.001)
            (1611.200 1680.400 0.001)
            (1611.200 1685.400 0.001)
            (1611.200 1310.400 5.001)
            (1611.200 1315.400 5.001)
            (1611.200 1320.400 5.001)
            (1611.200 1325.400 5.001)
            (1611.200 1330.400 5.001)
            (1611.200 1335.400 5.001)
            (1611.200 1340.400 5.001)
            (1611.200 1345.400 5.001)
            (1611.200 1350.400 5.001)
            (1611.200 1355.400 5.001)
            (1611.200 1360.400 5.001)
            (1611.200 1365.400 5.001)
            (1611.200 1370.400 5.001)
            (1611.200 1375.400 5.001)
            (1611.200 1380.400 5.001)
            (1611.200 1385.400 5.001)
            (1611.200 1390.400 5.001)
            (1611.200 1395.400 5.001)
            (1611.200 1400.400 5.001)
            (1611.200 1405.400 5.001)
            (1611.200 1410.400 5.001)
            (1611.200 1415.400 5.001)
            (1611.200 1420.400 5.001)
            (1611.200 1425.400 5.001)
...
            (1611.200 1685.400 215.001)

                          );
         }
      );
    }
