exampleCases/example.propALMAdvanced/system/sampling/cloud_9D
    cloudData9D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       50;
      setFormat            raw;
      fields
      (
         U
         omega
         Q
      );

      sets
      (
         sampleplane9D
         {
            type         cloud;
            axis         xyz;
            points       (

            (1737.600 1310.400 0.001)
            (1737.600 1315.400 0.001)
            (1737.600 1320.400 0.001)
            (1737.600 1325.400 0.001)
            (1737.600 1330.400 0.001)
            (1737.600 1335.400 0.001)
            (1737.600 1340.400 0.001)
            (1737.600 1345.400 0.001)
            (1737.600 1350.400 0.001)
            (1737.600 1355.400 0.001)
            (1737.600 1360.400 0.001)
            (1737.600 1365.400 0.001)
            (1737.600 1370.400 0.001)
            (1737.600 1375.400 0.001)
            (1737.600 1380.400 0.001)
            (1737.600 1385.400 0.001)
            (1737.600 1390.400 0.001)
            (1737.600 1395.400 0.001)
            (1737.600 1400.400 0.001)
            (1737.600 1405.400 0.001)
            (1737.600 1410.400 0.001)
            (1737.600 1415.400 0.001)
            (1737.600 1420.400 0.001)
            (1737.600 1425.400 0.001)
            (1737.600 1430.400 0.001)
            (1737.600 1435.400 0.001)
            (1737.600 1440.400 0.001)
            (1737.600 1445.400 0.001)
            (1737.600 1450.400 0.001)
            (1737.600 1455.400 0.001)
            (1737.600 1460.400 0.001)
            (1737.600 1465.400 0.001)
            (1737.600 1470.400 0.001)
            (1737.600 1475.400 0.001)
            (1737.600 1480.400 0.001)
            (1737.600 1485.400 0.001)
            (1737.600 1490.400 0.001)
            (1737.600 1495.400 0.001)
            (1737.600 1500.400 0.001)
            (1737.600 1505.400 0.001)
            (1737.600 1510.400 0.001)
            (1737.600 1515.400 0.001)
            (1737.600 1520.400 0.001)
            (1737.600 1525.400 0.001)
            (1737.600 1530.400 0.001)
            (1737.600 1535.400 0.001)
            (1737.600 1540.400 0.001)
            (1737.600 1545.400 0.001)
            (1737.600 1550.400 0.001)
            (1737.600 1555.400 0.001)
            (1737.600 1560.400 0.001)
            (1737.600 1565.400 0.001)
            (1737.600 1570.400 0.001)
            (1737.600 1575.400 0.001)
            (1737.600 1580.400 0.001)
            (1737.600 1585.400 0.001)
            (1737.600 1590.400 0.001)
            (1737.600 1595.400 0.001)
            (1737.600 1600.400 0.001)
            (1737.600 1605.400 0.001)
            (1737.600 1610.400 0.001)
            (1737.600 1615.400 0.001)
            (1737.600 1620.400 0.001)
            (1737.600 1625.400 0.001)
            (1737.600 1630.400 0.001)
            (1737.600 1635.400 0.001)
            (1737.600 1640.400 0.001)
            (1737.600 1645.400 0.001)
            (1737.600 1650.400 0.001)
            (1737.600 1655.400 0.001)
            (1737.600 1660.400 0.001)
            (1737.600 1665.400 0.001)
            (1737.600 1670.400 0.001)
            (1737.600 1675.400 0.001)
            (1737.600 1680.400 0.001)
            (1737.600 1685.400 0.001)
            (1737.600 1310.400 5.001)
            (1737.600 1315.400 5.001)
            (1737.600 1320.400 5.001)
            (1737.600 1325.400 5.001)
            (1737.600 1330.400 5.001)
            (1737.600 1335.400 5.001)
            (1737.600 1340.400 5.001)
            (1737.600 1345.400 5.001)
            (1737.600 1350.400 5.001)
            (1737.600 1355.400 5.001)
            (1737.600 1360.400 5.001)
            (1737.600 1365.400 5.001)
            (1737.600 1370.400 5.001)
            (1737.600 1375.400 5.001)
            (1737.600 1380.400 5.001)
            (1737.600 1385.400 5.001)
            (1737.600 1390.400 5.001)
            (1737.600 1395.400 5.001)
            (1737.600 1400.400 5.001)
            (1737.600 1405.400 5.001)
            (1737.600 1410.400 5.001)
            (1737.600 1415.400 5.001)
            (1737.600 1420.400 5.001)
            (1737.600 1425.400 5.001)
...
            (1737.600 1685.400 215.001)

                          );
         }
      );
    }
