exampleCases/example.propALMAdvanced/system/sampling/probeData3S
    probe3S
    {
          type                probes;
          functionObjectLibs ("libsampling.so");
          name                probe1;
          outputControl       timeStep;
          outputInterval      1;
          fields
          (
              Rwall
              qwall
          );
          
          probeLocations
          (
                   (2500.001 2500.001 0.0)
          );
    }
