exampleCases/example.propALMAdvanced/system/sampling/sliceDataInstantaneous
      sliceDataInstantaneous
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        timeStep;
          outputInterval       50;
          surfaceFormat        vtk;
          fields
          (
              U
              omega
              Q
          );
          surfaces
          (
              slice_horizontal
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 90.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_streamwise
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 90.01);
                  normalVector (0 1 0);
                  triangulate  false;
              }
          );
      }
