exampleCases/example.propALMAdvanced/system/sampling/sliceDataMean
      sliceDataMean
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        timeStep;
          outputInterval       1500;
          surfaceFormat        vtk;
          fields
          (
              UAvg
              p_rghAvg
              uuPrime2
              Rmean
              kSGSmean
              kResolved
              epsilonSGSmean
              omegaAvg
          );
          surfaces
          (
              slice_horizontal
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 90.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_streamwise
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 90.01);
                  normalVector (0 1 0);
                  triangulate  false;
              }
          );
      }
